In [1]:
import pandas as pd

## Checking out the data

We can use `head` to have a peek at the data. We can
specify the number of rows we desire.

In [2]:
df = pd.read_csv('cast.csv')
df.head()

                  title  year      name   type                character     n
0        Closet Monster  2015  Buffy #1  actor                  Buffy 4  31.0
1       Suuri illusioni  1985    Homo $  actor                   Guests  22.0
2   Battle of the Sexes  2017   $hutter  actor          Bobby Riggs Fan  10.0
3  Secret in Their Eyes  2015   $hutter  actor          2002 Dodger Fan   NaN
4            Steve Jobs  2015   $hutter  actor  1988 Opera House Patron   NaN

`head` and `tail` return a new pandas dataframe

## Indexing the Dataframe

We
can extract certain rows from the dataframe by
indexing.

In [3]:
df['year'].head()

0    2015
1    1985
2    2017
3    2015
4    2015
Name: year, dtype: int64

This gives us a pandas `Series` which contains a numpy array. We can perform
numpy operations on this e.g. math operations such as additions, subtraction,
comparison etc.

In [4]:
(df['year'] > 2018).head()

0    False
1    False
2    False
3    False
4    False
Name: year, dtype: bool

Indexing with an array of columns gives back a pandas dataframe containing the
specified columns

In [5]:
df.head()

                  title  year      name   type                character     n
0        Closet Monster  2015  Buffy #1  actor                  Buffy 4  31.0
1       Suuri illusioni  1985    Homo $  actor                   Guests  22.0
2   Battle of the Sexes  2017   $hutter  actor          Bobby Riggs Fan  10.0
3  Secret in Their Eyes  2015   $hutter  actor          2002 Dodger Fan   NaN
4            Steve Jobs  2015   $hutter  actor  1988 Opera House Patron   NaN

In [6]:
df[['year', 'title']].head()

   year                 title
0  2015        Closet Monster
1  1985       Suuri illusioni
2  2017   Battle of the Sexes
3  2015  Secret in Their Eyes
4  2015            Steve Jobs

With Indexing, we can filter the dataframe by desired conditions. For instance,
to view all cast that has year greater than or equal to, say, `2019`, we can
index the year and do a `>=` operation to get a Series of Booleans. We can then
use that Series to filter out the rows of the dataframe.

In [7]:
is_entry_year_greater_or_eq_than_2019 = df['year'] >= 2019

# index the dataframe to get the rows that have year greater than or equal 2019
cast_greater_than_or_eq_2019 = df[is_entry_year_greater_or_eq_than_2019]

In [8]:
len(cast_greater_than_or_eq_2019)

1848

In [9]:
cast_greater_than_or_eq_2019.head()

,title,year,name,type,character,n
505,Baron 3D,2019,Mohamed Aamer,actor,Adam,NaN
765,Blink of an Eye,2019,Justin Aaronson,actor,Security Guard 2,31.0
2119,Kingdom: Fall of Illandrieal,2019,Jake Abbott,actor,Carlyne,NaN
2466,Kingdom: Fall of Illandrieal,2019,Hamza Ripley Abdallah,actor,Gnor,NaN
6958,Aladdin,2019,Numan Acar,actor,Hakim,NaN

In [10]:
cast_greater_than_or_eq_2019.tail()

,title,year,name,type,character,n
3774832,Prince of Peace,2019,Carmen Zabaleta,actress,Daniel's mother,NaN
3779187,Untitled Spider-Man: Homecoming Sequel,2019,Zendaya,actress,Michelle Jones,NaN
3781734,TimeWarpers,2020,Jaquelen Zilva,actress,Maria Do Santos,NaN
3782142,The Invisible War,2020,Cary Zincke,actress,Florence Hereford,NaN
3782387,Tchnienie,2019,Emilia Ziolkowska,actress,Natasha,NaN

## Boolean Indexing `and` and `or`

Consider a scenario whereby we would like to
use the `and` or `or` operators on a Series to do a more complex comparison. The
raw python `and` and `or` cannot work with a Series, they work with primitive
Booleans. To use `and` or `or` with pandas Series, pandas makes use of the
bitwise operators `&` and `|`.

For instance, let us filter our casts dataframe
to only include cast where year is greater than or equal to 2015 and less than
or equal to 2016.

In [11]:
is_greater_than_or_eq_2015 = df['year'] >= 2015
is_less_than_or_eq_2016 = df['year'] <= 2016

In [12]:
between_2015_and_2016 = df[is_greater_than_or_eq_2015 & is_less_than_or_eq_2016]

# for or we can use the bitwise or |

In [13]:
len(between_2015_and_2016)

311606

In [14]:
between_2015_and_2016.head()

,title,year,name,type,character,n
0,Closet Monster,2015,Buffy #1,actor,Buffy 4,31.0
3,Secret in Their Eyes,2015,$hutter,actor,2002 Dodger Fan,NaN
4,Steve Jobs,2015,$hutter,actor,1988 Opera House Patron,NaN
5,Straight Outta Compton,2015,$hutter,actor,Club Patron,NaN
6,Straight Outta Compton,2015,$hutter,actor,Dopeman,NaN

In [15]:
between_2015_and_2016.tail()

,title,year,name,type,character,n
3786076,Kvinner i for store herreskjorter,2015,Gunnhild ?yehaug,actress,Fortellerstemme,29.0
3786079,Kvinner i for store herreskjorter,2015,Ingunn Beate ?yen,actress,Jordmor,16.0
3786108,Canim kardesim benim,2016,Sebnem ?naldi,actress,Lale,NaN
3786133,Iftarlik Gazoz,2016,Karya ?nsal,actress,Misafir Bebek,18.0
3786148,K (II),2015,?rchaihu,actress,Castle Inn Singer 2,NaN

We can sort the dataframe by columns

In [16]:
between_2015_and_2016.sort_values(['year', 'name']).head()

# We can use df.sort_value('column_name') to sort only by 'column_name'

,title,year,name,type,character,n
3,Secret in Their Eyes,2015,$hutter,actor,2002 Dodger Fan,NaN
4,Steve Jobs,2015,$hutter,actor,1988 Opera House Patron,NaN
5,Straight Outta Compton,2015,$hutter,actor,Club Patron,NaN
6,Straight Outta Compton,2015,$hutter,actor,Dopeman,NaN
1156809,Isai,2015,'Ganja' Karuppu,actor,Karuppu,5.0

We can set a desirable value to all null years in the dataframe

In [17]:
is_null_year = df['year'].isnull()
df.loc[is_null_year, 'year'] = 1900
df.head()

                  title  year      name   type                character     n
0        Closet Monster  2015  Buffy #1  actor                  Buffy 4  31.0
1       Suuri illusioni  1985    Homo $  actor                   Guests  22.0
2   Battle of the Sexes  2017   $hutter  actor          Bobby Riggs Fan  10.0
3  Secret in Their Eyes  2015   $hutter  actor          2002 Dodger Fan   NaN
4            Steve Jobs  2015   $hutter  actor  1988 Opera House Patron   NaN

Sometimes we may not want to do only
comparison checks when filtering dataframes. Sometimes we want string operations
like `startswith`, `len` etc. on a pandas Series i.e. column. We can make use of
the `str` namescape in order to access `str` methods.

The catch here is that
these `str` accessor can only be used with columns that contain String values.
Using `.str` on a non string column will cause an Attribute Error.

We can use
`.astype('str')` on a Dataframe or a Series.

In [18]:
df['year'].astype('str').str.startswith('20')

0           True
1          False
2           True
3           True
4           True
5           True
6           True
7           True
8           True
9           True
10          True
11          True
12         False
13          True
14          True
15          True
16          True
17          True
18          True
19         False
20         False
21          True
22          True
23          True
24          True
25         False
26         False
27          True
28         False
29          True
           ...
3786146     True
3786147     True
3786148     True
3786149     True
3786150     True
3786151     True
3786152     True
3786153    False
3786154    False
3786155     True
3786156     True
3786157     True
3786158     True
3786159     True
3786160     True
3786161    False
3786162    False
3786163     True
3786164     True
3786165    False
3786166     True
3786167     True
3786168     True
3786169     True
3786170    False
3786171    False
3786172     True
3786173    False
3786174     True
3786175    False
Name: year, Length: 3786176, dtype: bool

## String Methods on a Dataframe

Sometimes we may not want to do only
comparison checks when filtering dataframes. Sometimes we want string operations
like `startswith`, `len` etc. on a pandas Series i.e. column. We can make use of
the `str` namescape in order to access `str` methods.

The catch here is that
these `str` accessor can only be used with columns that contain String values.
Using `.str` on a non string column will cause an Attribute Error.

We can use
`.astype('str')` on a Dataframe or a Series.

In [19]:
df['year'].astype('str').str.startswith('20').head()

0     True
1    False
2     True
3     True
4     True
Name: year, dtype: bool

## Finding Frequecies in Data

We are sometimes interested in knowing the number
of occurences of an entry in a column of data. We can use `value_counts` to
achieve that.

In [20]:
df['year'].value_counts().head()

2017    159440
2016    159132
2015    152474
2014    151007
2013    142421
Name: year, dtype: int64

We ge a pandas Series, sorted in a descending order, from the above operation.
We could even plot the results for;

In [21]:
df['year'].value_counts().sort_index().plot()

## Working with the Index
The index plays a vital role in organising the data
and providing access to the data. We can get to data much faster much more than
we could otherwise.

### Setting the Index
We set an index on a dataframe using
the `set_index` pandas method.

In [22]:
df2 = df.set_index('title').sort_index()
# it is best to have a sorted index to speed up lookup operations
df2.head()

,year,name,type,character,n
title,,,,,
#1 Serial Killer,2013,Parry Shen,actor,Murder Victim,NaN
#1 Serial Killer,2013,Zachary (X) Brown,actor,Africian American Teen,18.0
#1 Serial Killer,2013,Eric (II) St. John,actor,Officer Williams,NaN
#1 Serial Killer,2013,Jinxia Ma,actress,Chinese Teacher,24.0
#1 Serial Killer,2013,Gemma Massot,actress,Betty Goodman,7.0

Running indexing operations on a dataframe requires us to use `loc` on the
dataframe, otherwise, pandas would think that we're trying to access a column.

In [23]:
df2.loc['Sleuth']
# we use loc to enable indexing.

        year                 name     type                   character    n
title
Sleuth  2007    Eve (II) Channing  actress             Marguerite Wyke  NaN
Sleuth  1972        Michael Caine    actor                 Milo Tindle  2.0
Sleuth  1972       Alec Cawthorne    actor           Inspector Doppler  3.0
Sleuth  2007      Kenneth Branagh    actor           Other Man on T.V.  NaN
Sleuth  2007        Harold Pinter    actor                 Man on T.V.  3.0
Sleuth  2007        Michael Caine    actor                      Andrew  1.0
Sleuth  1972   Eve (III) Channing  actress             Marguerite Wyke  5.0
Sleuth  2007  Alec (II) Cawthorne    actor           Inspector Doppler  NaN
Sleuth  1972   John (II) Matthews    actor  Detective Sergeant Tarrant  4.0
Sleuth  2007    Carmel O'Sullivan  actress                      Maggie  NaN
Sleuth  1972         Teddy Martin    actor      Police Constable Higgs  6.0
Sleuth  2007             Jude Law    actor                        Milo  2.0
Sleuth  1972     Laurence Olivier    actor                 Andrew Wyke  1.0

In order to filter multiple values from the index, we can pass an array e.g. of
Boolean values, or actual index values.

In [24]:
df3 = df2.loc[['Sleuth', '#1 Serial Killer']]
df3.head()

        year               name     type          character    n
title
Sleuth  2007  Eve (II) Channing  actress    Marguerite Wyke  NaN
Sleuth  1972      Michael Caine    actor        Milo Tindle  2.0
Sleuth  1972     Alec Cawthorne    actor  Inspector Doppler  3.0
Sleuth  2007    Kenneth Branagh    actor  Other Man on T.V.  NaN
Sleuth  2007      Harold Pinter    actor        Man on T.V.  3.0

In [25]:
df3.tail()

                  year             name     type         character     n
title
#1 Serial Killer  2013  Romina Bovolini  actress      Lisa Simpson  14.0
#1 Serial Killer  2013   Scott Eriksson    actor       Party Guest   NaN
#1 Serial Killer  2013    Kylee Cochran  actress  Jennifer Griffin   NaN
#1 Serial Killer  2013       Jesse Wang    actor          Mr. Tsai  11.0
#1 Serial Killer  2013    Patrick Chien    actor    Cleaver Victim  22.0

### Setting a Multi-index
We can also set multiple in a table. We do this by
setting the index with an array as follows;

In [26]:
df4 = df.set_index(['year', 'title']).sort_index()
df4.head()

                                         name     type  \
year title
1894 Miss Jerry             William Courtenay    actor
     Miss Jerry                Chauncey Depew    actor
     Miss Jerry               Blanche Bayliss  actress
1900 Soldiers of the Cross        Orrie Perry    actor
     Soldiers of the Cross          Reg Perry    actor

                                                                    character  \
year title
1894 Miss Jerry                                                  Mr. Hamilton
     Miss Jerry             Himself - the Director of the New York Central...
     Miss Jerry                          Miss Geraldine Holbrook (Miss Jerry)
1900 Soldiers of the Cross                                               Lion
     Soldiers of the Cross                                               Lion

                             n
year title
1894 Miss Jerry            NaN
     Miss Jerry            NaN
     Miss Jerry            NaN
1900 Soldiers of the Cross NaN
     Soldiers of the Cross NaN

With that in place, we can access the indexes in the order that we have
specified them in `set_index` above;

In [27]:
df5 = df4.loc[2013]
df5.head()

                               name   type               character     n
title
#1 Serial Killer      Michael Alton  actor       Detective Roberts  17.0
#1 Serial Killer         Aaron Aoki  actor      Plastic Bag Victim  21.0
#1 Serial Killer  Zachary (X) Brown  actor  Africian American Teen  18.0
#1 Serial Killer     Yvis Cannavale  actor            Homeless Man  25.0
#1 Serial Killer      Patrick Chien  actor          Cleaver Victim  22.0

Indexing with the second index. We have to execute `loc` again as the first
`loc` returns yet another dataframe;

In [28]:
df5 = df5.loc['48 minuten']
df5.head()

                           name   type character   n
title
48 minuten    Rogier in 't Hout  actor    Willem NaN
48 minuten     Raynor Arkenbout  actor    Docent NaN
48 minuten       Cas Basstiaans  actor       Tom NaN
48 minuten  Everon Jackson Hooi  actor   Patrick NaN
48 minuten        Sergio IJssel  actor      John NaN

A better approach would be to pass a tuple in the loc indexer;

In [29]:
df5 = df4.loc[(2013, '48 minuten')]
df5.head()

                                name   type character   n
year title
2013 48 minuten    Rogier in 't Hout  actor    Willem NaN
     48 minuten     Raynor Arkenbout  actor    Docent NaN
     48 minuten       Cas Basstiaans  actor       Tom NaN
     48 minuten  Everon Jackson Hooi  actor   Patrick NaN
     48 minuten        Sergio IJssel  actor      John NaN

On a dataframe that has multi index, we can conviniently reset desired columns
from the index using `reset_index` as follows;

In [30]:
df5.reset_index('year').head()
# This is going to remove `year` from the index and leave title

            year                 name   type character   n
title
48 minuten  2013    Rogier in 't Hout  actor    Willem NaN
48 minuten  2013     Raynor Arkenbout  actor    Docent NaN
48 minuten  2013       Cas Basstiaans  actor       Tom NaN
48 minuten  2013  Everon Jackson Hooi  actor   Patrick NaN
48 minuten  2013        Sergio IJssel  actor      John NaN

We can also reset multiple indexes by supplying an array to `reset_index`;

In [31]:
df5.reset_index(['year', 'title']).head()

   year       title                 name   type character   n
0  2013  48 minuten    Rogier in 't Hout  actor    Willem NaN
1  2013  48 minuten     Raynor Arkenbout  actor    Docent NaN
2  2013  48 minuten       Cas Basstiaans  actor       Tom NaN
3  2013  48 minuten  Everon Jackson Hooi  actor   Patrick NaN
4  2013  48 minuten        Sergio IJssel  actor      John NaN

Removing all indexes will result to a zero-initialised default index.

##
Grouping in a Pandas Dataframe
This is very useful when doing aggregations.

In [32]:
df.head()

                  title  year      name   type                character     n
0        Closet Monster  2015  Buffy #1  actor                  Buffy 4  31.0
1       Suuri illusioni  1985    Homo $  actor                   Guests  22.0
2   Battle of the Sexes  2017   $hutter  actor          Bobby Riggs Fan  10.0
3  Secret in Their Eyes  2015   $hutter  actor          2002 Dodger Fan   NaN
4            Steve Jobs  2015   $hutter  actor  1988 Opera House Patron   NaN

For a start, we can group by a column as follows;

In [33]:
df6 = df.groupby('year').size()
df6.head()

year
1894     3
1900     2
1905     1
1906    17
1907     5
dtype: int64

Whenever we do a groupby on an dataframe in pandas, we set up an index with the
groupby property. i.e. in the above example, we will now have an index created
with the year property.

We can also group by multiple properties by suppling an
array to the groupby method;

In [34]:
df7 = df.groupby(['title', 'character']).size()
df7.head()

title             character
#1 Serial Killer  Africian American Teen    1
                  Amber Sterling            1
                  Betty Goodman             1
                  Brian Bennett             1
                  Cathherine                1
dtype: int64

This  is going to create a hierarchical multi index with title and year in that
order. Before grouping the data, it's often paramount that we filter the rows to
narrow our focus to only the items that we're interested in. For instance, we
can begin by filtering out the cast for a certain `name` e.g. Emmett Vogan as
follows;

In [35]:
df7 = df[df.name == 'Emmett Vogan']
df7.head()

,title,year,name,type,character,n
2370255,$1000 a Touchdown,1939,Emmett Vogan,actor,Coach,NaN
2370256,'G' Men,1935,Emmett Vogan,actor,Bill - the Ballistics Expert,NaN
2370257,45 Fathers,1937,Emmett Vogan,actor,Court Clerk,NaN
2370258,A Close Call for Boston Blackie,1946,Emmett Vogan,actor,Coroner,NaN
2370259,A Fig Leaf for Eve,1944,Emmett Vogan,actor,Thomas W. Campbell - Attorney,5.0

We can now do an analysis focusing on Emmett Vogan. For instance we may be
interested in seeing the count of occurences per year. i.e. we need to  group
the filtered data and then use size as the group accumulator. Check it out;

In [36]:
df7.groupby(['year']).size()
# this accumulates similar years by size i.e. count

year
1934    14
1935    25
1936    30
1937    28
1938    24
1939    33
1940    27
1941    32
1942    32
1943    27
1944    36
1945    39
1946    26
1947    20
1948    15
1949    14
1950     2
1951     9
1952     7
1953     6
1954     3
1956     1
dtype: int64

### Group Accumulators
Besides size we can use more accumulators on the groupby
object. For instance, we can use;
- max and min
- sum, product, etc
- mean,
median, mode, std etc.

We do not have to perform the accumulation directly on
the groupby object. We can perform accumulations on properties of the dataframe.
For instance, the column `n` denoting the ranking of the character in the movie,
we can see poorest ranking for Emmett Vogan in each year by grouping the data by
year and then using the `max` accumulator on column `n`.

In [37]:
df7.groupby(['year'])['n'].max() # we can also do .n.max()

year
1934    10.0
1935     NaN
1936    29.0
1937    12.0
1938    27.0
1939    18.0
1940    29.0
1941    16.0
1942    16.0
1943    24.0
1944    18.0
1945    13.0
1946    22.0
1947    10.0
1948    14.0
1949    18.0
1950    11.0
1951    10.0
1952    19.0
1953     9.0
1954     NaN
1956     NaN
Name: n, dtype: float64

We are also not limited to use only existing properties to groupby. We can
actually use dynamically computed values against which to group the data. For
instance, instead of grouping by the year as above, we may be interested in
grouping by the decade which is a property that does not exist on the dataframe.
This can be dynamically computed from the year as;

$$
  decade =
\lfloor\frac{year}{10}\rfloor \cdot 10
$$

That is the floor division of the
year by 10 and multiply the result by 10.

In [38]:
decades = (df7.year // 10) * 10;
df7.groupby([decades]).n.max()

year
1930    29.0
1940    29.0
1950    19.0
Name: n, dtype: float64

## Unstacking and stacking indexes
Sometimes we may want to transform a vertical
index into a horizontal index in order to compare the values as columns.
Consider a scenario where we'd like to get the difference between the total
number of actors and actresses in each decade. We'd proceed by grouping the data
by decades and by the `type` attribute of the data. This would result into a
Series with decade and type indexes.

In [39]:
df8 = df
decades = (df8.year // 10) * 10
gr = df8.groupby(['type', decades]).size()
gr

type     year
actor    1890         2
         1900        54
         1910     27605
         1920     48726
         1930    151290
         1940    162364
         1950    157738
         1960    134605
         1970    152811
         1980    197530
         1990    263000
         2000    489468
         2010    747346
         2020       140
         2110         2
actress  1890         1
         1900        16
         1910     15830
         1920     24075
         1930     49972
         1940     51795
         1950     57733
         1960     57744
         1970     66974
         1980     91509
         1990    125040
         2000    263941
         2010    448737
         2020       127
         2110         1
dtype: int64

In order to get the differences, we'd like to put them side by side. The operation to achieve this is to `unstack` the `type` index to the horizontal index.

In [40]:
u = gr.unstack()
u

year,1890,1900,1910,1920,1930,1940,1950,1960,1970,1980,1990,2000,2010,2020,2110
type,,,,,,,,,,,,,,,
actor,2,54,27605,48726,151290,162364,157738,134605,152811,197530,263000,489468,747346,140,2
actress,1,16,15830,24075,49972,51795,57733,57744,66974,91509,125040,263941,448737,127,1

As we can see above, `unstack`, by default, takes the innermost vertical index and moves it to the horizontal index. In our case, this is not the behaviour that we'd like, nor is it the output that we desire. We're looking to move the `type` to the horzontal index. We can do that by specifying the integer index of the index we're targeting and this is 0 for `type`. Alternatively, we can specify the index by name i.e. `type`.

In [41]:
u = gr.unstack('type') # unstack(0)
u

type   actor  actress
year
1890       2        1
1900      54       16
1910   27605    15830
1920   48726    24075
1930  151290    49972
1940  162364    51795
1950  157738    57733
1960  134605    57744
1970  152811    66974
1980  197530    91509
1990  263000   125040
2000  489468   263941
2010  747346   448737
2020     140      127
2110       2        1

Most of the time, an `unstack` operation leads to having some columns with the value `NaN` when pandas can not determine a value to put in a particular cell. We can use the `fillna()` method to fill the unavailable values with an arbitrary value e.g. the mean, a random, a string like 'hello', etc.

The operation `unstack` has the opposite of it called, `stack`.












## Appendix
### Some methods to keep in mind

- `s.str.` - access string methods
on a series e.g. starts_with, join etc.
- `s.sort_index` - sort by the index
-
`s.value_counts` - entry frequencies
- `df[condition1 & condition2]` - chaining
conditions when filtering columns. Use bitwise | for conditional `or` in pandas.
- `df.loc[<row_indexer>, <col_indexer>]` - access numpy-like row and column